IdeaRS.OpenModel.Concrete.ValueTypec
Define type of c value

IdeaRS.OpenModel.Concrete.ValueTypec.UserDefined
Value is inputed by user

IdeaRS.OpenModel.Concrete.ValueTypec.ConstantCurvatureDistribution
Value depends on constant curvature distributio

IdeaRS.OpenModel.Concrete.ValueTypec.SinusoidalCurvatureDistribution
Value depends on sinusoidal curvature distribution